Documents/УстановкаЦенНоменклатурыКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Document>
		<Properties>
			<Name>УстановкаЦенНоменклатурыКонтрагентов</Name>
			<Comment>(Упр)</Comment>
			<BasedOn>
				<xr:Item>Document.ПоступлениеТоваровУслуг</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ЦеныНоменклатурыКонтрагентов</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеПроводитьНулевыеЗначения</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Информация</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидНоменклутары</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХарактеристикаНоменклатуры</Name>
							<Comment>Характеристика номенклатуры</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Валюта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипЦен</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ТипыЦенНоменклатурыКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИндексСтрокиТаблицыЦен</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Остаток</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>7</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Примечание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НоменклатураПоставщика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НоменклатураПоставщика</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаБН</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РекОпт</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РекОптБН</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РекРозница</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РекРозницаБН</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПроизводства</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Производитель</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЧерныйСписок</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ширина</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Ширина</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Высота</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Профиль</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Диаметр</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Диаметр</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>PCD1</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КрепежныеОтверствия</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вылет</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВылетДисков</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МІСТО</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>99</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Поставщик</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>99</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Проблема</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Название</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТипыЦен</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТипЦен</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ТипыЦенНоменклатурыКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/ЦеныНоменклатурыКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>ЦеныНоменклатурыКонтрагентов</Name>
			<Comment>(Упр)</Comment>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Остаток</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>8</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЦенаБН</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РекОпт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РекОптБН</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РекРозница</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РекРозницаБН</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьДатаПроизводства</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьПроизводитель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МІСТО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>99</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>99</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТипЦен</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыЦенНоменклатурыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ДатыПроизводства.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>ДатыПроизводства</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаПроизводства</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Страна</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/УстановкаЦенНоменклатурыКонтрагентов/Ext/ObjectModule.bsl
//FOFA Внимательно
Перем мУдалятьДвижения;

Перем мИспользоватьХарактеристики Экспорт;

////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ДОКУМЕНТА

#Если Клиент Тогда
	
	// Функция формирует табличный документ с печатной формой накладной,
	// разработанной методистами
	//
	// Возвращаемое значение:
	//  Табличный документ - печатная форма накладной
	//
	Функция ПечатьДокумента()
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ТекущийДокумент", ЭтотОбъект.Ссылка);
		Запрос.Текст ="
		|ВЫБРАТЬ
		|	УстановкаЦенНоменклатурыКонтрагентов.Номер,
		|	УстановкаЦенНоменклатурыКонтрагентов.Дата,
		|	УстановкаЦенНоменклатурыКонтрагентов.Ответственный.ФизЛицо.Наименование КАК ОтветственныйПредставление,
		|	ВЫБОР КОГДА УстановкаЦенНоменклатурыКонтрагентов.Контрагент.НаименованиеПолное ПОДОБНО """" ТОГДА
		|		УстановкаЦенНоменклатурыКонтрагентов.Контрагент.Наименование
		|	ИНАЧЕ
		|		УстановкаЦенНоменклатурыКонтрагентов.Контрагент.НаименованиеПолное
		|	КОНЕЦ КАК ПредставлениеКонтрагента
		|ИЗ
		|	Документ.УстановкаЦенНоменклатурыКонтрагентов КАК УстановкаЦенНоменклатурыКонтрагентов
		|ГДЕ
		|	УстановкаЦенНоменклатурыКонтрагентов.Ссылка = &ТекущийДокумент
		|";
		
		Шапка = Запрос.Выполнить().Выбрать();
		Шапка.Следующий();
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ТекущийДокумент", ЭтотОбъект.Ссылка);
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	(УстановкаЦенНоменклатурыКонтрагентов.ИндексСтрокиТаблицыЦен + 1)              КАК НомерСтроки,
		|	УстановкаЦенНоменклатурыКонтрагентов.Номенклатура,
		|	УстановкаЦенНоменклатурыКонтрагентов.Номенклатура.НаименованиеПолное           КАК Товар,
		|	УстановкаЦенНоменклатурыКонтрагентов.ХарактеристикаНоменклатуры                КАК Характеристика,
		|	NULL                                                                           КАК Серия,
		|	УстановкаЦенНоменклатурыКонтрагентов.ТипЦен                                    КАК ТипЦен,
		|	УстановкаЦенНоменклатурыКонтрагентов.Цена,
		|	УстановкаЦенНоменклатурыКонтрагентов.ЕдиницаИзмерения.Представление            КАК ЕдиницаИзмерения,
		|	УстановкаЦенНоменклатурыКонтрагентов.Валюта,
		|	УстановкаЦенНоменклатурыКонтрагентов.Валюта.Представление                      КАК ВалютаПредставление
		|
		|ИЗ
		|	Документ.УстановкаЦенНоменклатурыКонтрагентов.Товары КАК УстановкаЦенНоменклатурыКонтрагентов
		|
		|ГДЕ
		|	УстановкаЦенНоменклатурыКонтрагентов.Ссылка = &ТекущийДокумент
		|
		|УПОРЯДОЧИТЬ ПО
		|	УстановкаЦенНоменклатурыКонтрагентов.ИндексСтрокиТаблицыЦен,
		|	УстановкаЦенНоменклатурыКонтрагентов.ТипЦен
		|
		|ИТОГИ
		|ПО УстановкаЦенНоменклатурыКонтрагентов.ИндексСтрокиТаблицыЦен
		|";
		
		ЗапросПоТоварам = Запрос.Выполнить();
		
		ТабДокумент = Новый ТабличныйДокумент;
		ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_УстановкаЦенНоменклатурыКонтрагентов_ИзменениеЦен";
		
		Макет = ПолучитьМакет("ИзменениеЦен");
		
		// печать производится на языке, указанном в настройках пользователя
		КодЯзыкаПечать = Локализация.ПолучитьЯзыкФормированияПечатныхФорм(УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "РежимФормированияПечатныхФорм"));
		Макет.КодЯзыкаМакета = КодЯзыкаПечать;
		
		ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
		ОбластьМакета.Параметры.ТекстЗаголовка = ОбщегоНазначения.СформироватьЗаголовокДокумента(ЭтотОбъект, НСтр("ru='Изменение цен номенклатуры';uk='Зміна цін номенклатури'",КодЯзыкаПечать),КодЯзыкаПечать);
		ТабДокумент.Вывести(ОбластьМакета);
		
		ОбластьМакета = Макет.ПолучитьОбласть("Контрагент");
		ОбластьМакета.Параметры.Заполнить(Шапка);
		ТабДокумент.Вывести(ОбластьМакета);
		
		ОбластьШапкаНоменклатура   = Макет.ПолучитьОбласть("ШапкаТаблицы|Номенклатура");
		ОбластьШапкаТипЦен         = Макет.ПолучитьОбласть("ШапкаТаблицы|Цена");
		ОбластьСтрокаНоменклатура  = Макет.ПолучитьОбласть("Строка|Номенклатура");
		ОбластьСтрокаТипЦен        = Макет.ПолучитьОбласть("Строка|Цена");
		ОбластьПодвалНоменклатура  = Макет.ПолучитьОбласть("Подписи|Номенклатура");
		ОбластьПодвалТипЦен        = Макет.ПолучитьОбласть("Подписи|Цена");
		
		// Выведем шапку
		ТабДокумент.Вывести(ОбластьШапкаНоменклатура);
		ВыборкаПоСтрокам = ЗапросПоТоварам.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Если ВыборкаПоСтрокам.Следующий() Тогда
			Выборка = ВыборкаПоСтрокам.Выбрать();
			Пока Выборка.Следующий() Цикл
				ОбластьШапкаТипЦен.Параметры.Заполнить(Выборка);
				ТабДокумент.Присоединить(ОбластьШапкаТипЦен);
			КонецЦикла;
		КонецЕсли;
		
		// Выведем таблицу
		ВыборкаПоСтрокам = ЗапросПоТоварам.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаПоСтрокам.Следующий() Цикл
			НоменклатураВыведена = Ложь;
			Выборка = ВыборкаПоСтрокам.Выбрать();
			Пока Выборка.Следующий() Цикл
				Если НЕ НоменклатураВыведена Тогда
					ОбластьСтрокаНоменклатура.Параметры.Заполнить(Выборка);
					ОбластьСтрокаНоменклатура.Параметры.Товар = СокрЛП(Выборка.Товар) + ФормированиеПечатныхФорм.ПредставлениеСерий(Выборка);
					ТабДокумент.Вывести(ОбластьСтрокаНоменклатура);
					НоменклатураВыведена = Истина;
				КонецЕсли;
				ОбластьСтрокаТипЦен.Параметры.Заполнить(Выборка);
				ТабДокумент.Присоединить(ОбластьСтрокаТипЦен);
			КонецЦикла;
		КонецЦикла;
		
		// Выведем подвал
		ОбластьПодвалНоменклатура.Параметры.Заполнить(Шапка);
		ТабДокумент.Вывести(ОбластьПодвалНоменклатура);
		ВыборкаПоСтрокам = ЗапросПоТоварам.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Если ВыборкаПоСтрокам.Следующий() Тогда
			Выборка = ВыборкаПоСтрокам.Выбрать();
			Пока Выборка.Следующий() Цикл
				ТабДокумент.Присоединить(ОбластьПодвалТипЦен);
			КонецЦикла;
		КонецЕсли;
		
		ТекОбласть = ТабДокумент.Области.ОтветственныйПредставление;
		
		ОбластьОтветственного = ТабДокумент.Область(ТекОбласть.Низ, 14, ТекОбласть.Низ, Мин(ТабДокумент.ШиринаТаблицы, 27));
		ОбластьОтветственного.Объединить();
		ОбластьОтветственного.ГраницаСнизу            = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная);
		ОбластьОтветственного.ГоризонтальноеПоложение = ГоризонтальноеПоложение.Право;
		
		Возврат ТабДокумент;
		
	КонецФункции // ПечатьДокумента()
	
	// Процедура осуществляет печать документа. Можно направить печать на 
	// экран или принтер, а также распечатать необходмое количество копий.
	//
	//  Название макета печати передается в качестве параметра,
	// по переданному названию находим имя макета в соответствии.
	//
	// Параметры:
	//  НазваниеМакета - строка, название макета.
	//
	Процедура Печать(ИмяМакета, КоличествоЭкземпляров = 1, НаПринтер = Ложь, Форма = Неопределено) Экспорт
		
		Если ЭтоНовый() Тогда
			Предупреждение("Документ можно распечатать только после его записи");
			Возврат;
		ИначеЕсли Не УправлениеДопПравамиПользователей.РазрешитьПечатьНепроведенныхДокументов(Проведен) Тогда
			Предупреждение("Недостаточно полномочий для печати непроведенного документа!");
			Возврат;
		КонецЕсли;
		
		Если Не РаботаСДиалогами.ПроверитьМодифицированность(ЭтотОбъект) Тогда
			Возврат;
		КонецЕсли;
		
		Если ИмяМакета = "ПереченьЦен" Тогда
			// Получить экземпляр документа на печать
			ТабДокумент = ПечатьДокумента();
			
		ИначеЕсли ТипЗнч(ИмяМакета) = Тип("ДвоичныеДанные") Тогда
			
			ТабДокумент = УниверсальныеМеханизмы.НапечататьВнешнююФорму(Ссылка, ИмяМакета);
			
			Если ТабДокумент = Неопределено Тогда
				Возврат
			КонецЕсли; 
			
		КонецЕсли;
		
		УниверсальныеМеханизмы.НапечататьДокумент(ТабДокумент, КоличествоЭкземпляров, НаПринтер, ОбщегоНазначения.СформироватьЗаголовокДокумента(ЭтотОбъект, ЭтотОбъект.Метаданные().Представление()), Ссылка);
		
	КонецПроцедуры // Печать
	
	// Возвращает доступные варианты печати документа
	//
	// Вовращаемое значение:
	//  Струткура, каждая строка которой соответствует одному из вариантов печати
	//  
	Функция ПолучитьСтруктуруПечатныхФорм() Экспорт
		
		Возврат Новый Структура("ПереченьЦен","Перечень цен");
		
	КонецФункции // ПолучитьСтруктуруПечатныхФорм()
	
	// Возвращает доступные табличные части для заполнения
	//
	// Возвращаемое значение:
	//   Список значений с именами табличных частей
	//
	Функция ПолучитьТабличныеЧастиДляЗаполнения() Экспорт
		
		ТабличныеЧасти = Новый СписокЗначений;
		ТабличныеЧасти.Добавить("ТаблицаЦен", "Таблица цен");
		
		Возврат ТабличныеЧасти;
		
	КонецФункции // ПолучитьТабличныеЧастиДляЗаполнения()
	
#КонецЕсли
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ ОБЕСПЕЧЕНИЯ ПРОВЕДЕНИЯ ДОКУМЕНТА


// Проверяет правильность заполнения шапки документа.
// Если какой-то из реквизтов шапки, влияющий на проведение не заполнен или
// заполнен не корректно, то выставляется флаг отказа в проведении.
// Проверка выполняется по выборке из результата запроса по шапке,
// все проверяемые реквизиты должны быть включены в выборку по шапке.
//
// Параметры: 
//  ВыборкаПоШапкеДокумента	- выборка из результата запроса по шапке документа,
//  Отказ 					- флаг отказа в проведении.
//
Процедура ПроверитьЗаполнениеШапки(СтруктураШапкиДокумента, Отказ, Заголовок)
	
	// Укажем, что надо проверить:
	СтруктураОбязательныхПолей = Новый Структура("Контрагент");
	
	// Теперь вызовем общую процедуру проверки.
	ЗаполнениеДокументов.ПроверитьЗаполнениеШапкиДокумента(ЭтотОбъект, СтруктураОбязательныхПолей, Отказ, Заголовок);
	
КонецПроцедуры // ПроверитьЗаполнениеШапки()

// Проверяет правильность заполнения строк табличной части "Товары".
//
// Параметры:
// Параметры: 
//  ТаблицаПоТоварам        - таблица значений, содержащая данные для проведения и проверки ТЧ Товары
//  СтруктураШапкиДокумента - структура, содержащая реквизиты шапки документа и результаты запроса по шапке
//  Отказ                   - флаг отказа в проведении.
//  Заголовок               - строка, заголовок сообщения об ошибке проведения.
//
Процедура ПроверитьЗаполнениеТабличнойЧастиТовары(ТаблицаПоТоварам, СтруктураШапкиДокумента, Отказ, Заголовок)
	
	// Общую процедуру проверки в этом документе звать нельзя, потому что номер строки в форме документа
	// отличается от системного.
	Для каждого СтрокаТаблицы Из ТаблицаПоТоварам Цикл
		
		СтрокаНачалаСообщенияОбОшибке = "В строке номер """+ СокрЛП(СтрокаТаблицы.ИндексСтрокиТаблицыЦен + 1) +
		""" табличной части для типа цен """ 
		+ СокрЛП(СтрокаТаблицы.ТипЦен) + """ ";
		
		// Номенклатура.
		Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.Номенклатура) и Не СтрокаТаблицы.ЧерныйСписок Тогда//FOFA
			
			ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "не заполнена Номенклатура.", Отказ, Заголовок);;
			
		КонецЕсли;
		
		// Валюта.
		Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.Валюта) Тогда
			
			ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "не заполнена Валюта.", Отказ, Заголовок);;
			
		КонецЕсли;
		
		// Единица для товаров.
		Если (ЗначениеЗаполнено(СтрокаТаблицы.Номенклатура))
			И (Не СтрокаТаблицы.Услуга)
			И НЕ ЗначениеЗаполнено(СтрокаТаблицы.ЕдиницаИзмерения) Тогда
			
			ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "не заполнена единица измерения.", Отказ, Заголовок);;
			
			
		КонецЕсли;
		
		// Наборов-пакетов здесь быть не должно.
		Если ЗначениеЗаполнено(СтрокаТаблицы.Номенклатура) 
			И  СтрокаТаблицы.Набор Тогда
			
			ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "содержится набор-пакет. " +
			"Наборов-пакетов здесь быть не должно!", Отказ, Заголовок);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры // ПроверитьЗаполнениеТабличнойЧастиТовары()

// Выполняет движения по регистрам 
//
Процедура ДвиженияПоРегистрам(СтруктураШапкиДокумента, ТаблицаПоТоварам, Отказ, Заголовок)
	
	НаборДвижений   = Движения.ЦеныНоменклатурыКонтрагентов;
	ТаблицаДвижений = НаборДвижений.ВыгрузитьКолонки();
	
	// Заполним таблицу движений.
	ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаПоТоварам, ТаблицаДвижений);
	
	НаборДвижений.мПериод          = Дата;
	НаборДвижений.мТаблицаДвижений = ТаблицаДвижений;
	
	Если Не Отказ Тогда
		Движения.ЦеныНоменклатурыКонтрагентов.ВыполнитьДвижения();
	КонецЕсли;	
	
КонецПроцедуры // ДвиженияПоРегистрам

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

// Процедура - обработчик события "ОбработкаЗаполнения".
//
Процедура ОбработкаЗаполнения(Основание)
	
	Если ТипЗнч(Основание) = Тип("ДокументСсылка.ПоступлениеТоваровУслуг") Тогда
		
		// Заполним реквизиты из стандартного набора по документу основанию.
		ЗаполнениеДокументов.ЗаполнитьШапкуДокументаПоОснованию(ЭтотОбъект, Основание);
		
	КонецЕсли;
	
КонецПроцедуры // ОбработкаЗаполнения()

// Процедура - обработчик события "ОбработкаПроведения".
//
Процедура ОбработкаПроведения(Отказ, Режим)
	
	
	Если мУдалятьДвижения Тогда
		ОбщегоНазначения.УдалитьДвиженияРегистратора(ЭтотОбъект, Отказ);
	КонецЕсли;
	
	// Сформируем структуру реквизитов шапки документа
	СтруктураШапкиДокумента = ОбщегоНазначения.СформироватьСтруктуруШапкиДокумента(ЭтотОбъект);
	
	// Заголовок для сообщений об ошибках проведения.
	Заголовок = ОбщегоНазначения.ПредставлениеДокументаПриПроведении(СтруктураШапкиДокумента);
	
	// Заполним по шапке документа дерево параметров, нужных при проведении.
	ДеревоПолейЗапросаПоШапке = ОбщегоНазначения.СформироватьДеревоПолейЗапросаПоШапке();
	
	// Сформируем запрос на дополнительные параметры, нужные при проведении, по данным шапки документа
	СтруктураШапкиДокумента = УправлениеЗапасами.СформироватьЗапросПоДеревуПолей(ЭтотОбъект, ДеревоПолейЗапросаПоШапке, СтруктураШапкиДокумента, "");
	
	ПроверитьЗаполнениеШапки(СтруктураШапкиДокумента, Отказ, Заголовок);
	
	СтруктураПолей = Новый Структура;
	СтруктураПолей.Вставить("Номенклатура",               "Номенклатура");
	СтруктураПолей.Вставить("ИндексСтрокиТаблицыЦен"    , "ИндексСтрокиТаблицыЦен");
	СтруктураПолей.Вставить("Набор"                     , "Номенклатура.Набор");
	СтруктураПолей.Вставить("Услуга"                     , "Номенклатура.Услуга");
	СтруктураПолей.Вставить("ХарактеристикаНоменклатуры", "ХарактеристикаНоменклатуры");
	СтруктураПолей.Вставить("Цена",                       "Цена");
	СтруктураПолей.Вставить("Валюта",                     "Валюта");
	СтруктураПолей.Вставить("ЕдиницаИзмерения",           "ЕдиницаИзмерения");
	СтруктураПолей.Вставить("ТипЦен",                     "ТипЦен");
	СтруктураПолей.Вставить("Остаток",                     "Остаток");	
	
	СтруктураПолей.Вставить("ЦенаБН",                     "ЦенаБН");	
	СтруктураПолей.Вставить("РекОпт",                     "РекОпт");	
	СтруктураПолей.Вставить("РекОптБН",                     "РекОптБН");	
	СтруктураПолей.Вставить("МІСТО",                     "МІСТО");	
	СтруктураПолей.Вставить("Поставщик",                     "Поставщик");		
	СтруктураПолей.Вставить("РекРозница",                     "РекРозница");	
	СтруктураПолей.Вставить("РекРозницаБН",                     "РекРозницаБН");	
	СтруктураПолей.Вставить("ЧерныйСписок",                     "ЧерныйСписок");	
	СтруктураПолей.Вставить("Примечание",                     "Примечание");	
	
	РезультатЗапросаПоТоварам = ОбщегоНазначения.СформироватьЗапросПоТабличнойЧасти(ЭтотОбъект, "Товары", СтруктураПолей);
	ТаблицаПоТоварам          = РезультатЗапросаПоТоварам.Выгрузить();
	
	Если СтруктураШапкиДокумента.НеПроводитьНулевыеЗначения Тогда
		Сч = 0;
		Пока Сч < ТаблицаПоТоварам.Количество() Цикл
			СтрокаТаблицы = ТаблицаПоТоварам.Получить(Сч);
			Если СтрокаТаблицы.Цена = 0 Тогда
				ТаблицаПоТоварам.Удалить(СтрокаТаблицы);
			Иначе
				Сч = Сч + 1;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	Сч = 0;
	Пока Сч < ТаблицаПоТоварам.Количество() Цикл
		СтрокаТаблицы = ТаблицаПоТоварам.Получить(Сч);
		Если СтрокаТаблицы.ЧерныйСписок Тогда
			ТаблицаПоТоварам.Удалить(СтрокаТаблицы);
		Иначе
			Сч = Сч + 1;
		КонецЕсли;
	КонецЦикла;
	
	ПроверитьЗаполнениеТабличнойЧастиТовары(ТаблицаПоТоварам, СтруктураШапкиДокумента, Отказ, Заголовок);
	
	Если Не Отказ Тогда
		ДвиженияПоРегистрам(СтруктураШапкиДокумента, ТаблицаПоТоварам,Отказ, Заголовок);
	КонецЕсли;
	//Состояние("Перезапись номенклатуры поставщика");//FOFA
	Для Каждого Строка Из Товары Цикл
		Если Не Строка.НоменклатураПоставщика.Пустая() Тогда
			Ном = Строка.НоменклатураПоставщика.ПолучитьОбъект();
			Ном.Номенклатура = Строка.Номенклатура;
			Ном.ВидНоменклатуры = Строка.Номенклатура.ВидНоменклатуры;
			Ном.Записать();
		КонецЕслИ;
	КонецЦикла;
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЦеныНоменклатурыКонтрагентовСрезПоследних.ТипЦен,
	               |	ЦеныНоменклатурыКонтрагентовСрезПоследних.Номенклатура,
	               |	ЦеныНоменклатурыКонтрагентовСрезПоследних.ХарактеристикаНоменклатуры,
	               |	ЦеныНоменклатурыКонтрагентовСрезПоследних.ЕдиницаИзмерения,
	               |	ЦеныНоменклатурыКонтрагентовСрезПоследних.Валюта,
	               |	ЦеныНоменклатурыКонтрагентовСрезПоследних.Цена,
	               |	ЦеныНоменклатурыКонтрагентовСрезПоследних.Остаток,
	               |	ЦеныНоменклатурыКонтрагентовСрезПоследних.Примечание,
	               |	ЦеныНоменклатурыКонтрагентовСрезПоследних.ЦенаБН,
	               |	ЦеныНоменклатурыКонтрагентовСрезПоследних.РекОпт,
	               |	ЦеныНоменклатурыКонтрагентовСрезПоследних.РекОптБН,
	               |	ЦеныНоменклатурыКонтрагентовСрезПоследних.РекРозница,
	               |	ЦеныНоменклатурыКонтрагентовСрезПоследних.РекРозницаБН,
	               |	ЕСТЬNULL(ВложенныйЗапрос.Цена, 0) КАК Цена1
	               |ИЗ
	               |	РегистрСведений.ЦеныНоменклатурыКонтрагентов.СрезПоследних(
	               |			&Дата,
	               |			ТипЦен.Владелец = &Контр
	               |				И Номенклатура.ВидНоменклатуры = &ВидН
	               |				И Валюта = &Вал) КАК ЦеныНоменклатурыКонтрагентовСрезПоследних
	               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			УстановкаЦенНоменклатурыКонтрагентовТовары.Номенклатура КАК Номенклатура,
	               |			МАКСИМУМ(УстановкаЦенНоменклатурыКонтрагентовТовары.Цена) КАК Цена
	               |		ИЗ
	               |			Документ.УстановкаЦенНоменклатурыКонтрагентов.Товары КАК УстановкаЦенНоменклатурыКонтрагентовТовары
	               |		ГДЕ
	               |			УстановкаЦенНоменклатурыКонтрагентовТовары.Ссылка = &Док
	               |		
	               |		СГРУППИРОВАТЬ ПО
	               |			УстановкаЦенНоменклатурыКонтрагентовТовары.Номенклатура) КАК ВложенныйЗапрос
	               |		ПО ЦеныНоменклатурыКонтрагентовСрезПоследних.Номенклатура = ВложенныйЗапрос.Номенклатура";
	Запрос.УстановитьПараметр("Контр",Контрагент);
	Запрос.УстановитьПараметр("Вал",Валюта);
	Запрос.УстановитьПараметр("Док",Ссылка);
	
	Запрос.УстановитьПараметр("ВидН",ВидНоменклутары);
	
	Запрос.УстановитьПараметр("Дата",НачалоДня(Дата)-1);
	Рез = Запрос.Выполнить().Выбрать();
	Пока Рез.Следующий() Цикл
		//Нашли = Ложь;
		//СтрукСтрок = новый Структура;
		//СтрукСтрок.Вставить("Номенклатура",Рез.Номенклатура);
		//СтрукСтрок.Вставить("ЧерныйСписок",Ложь);
		//Строки = Товары.НайтиСтроки(СтрукСтрок);
		//Если Строки.Количество() > 0 Тогда
		//		Нашли = Истина;
		//	КонецЕсли;
		Если Рез.Цена1  = 0 Тогда
			если Рез.Цена <> 0 или Рез.ЦенаБн<>0 Тогда
				Движение = Движения.ЦеныНоменклатурыКонтрагентов.Добавить();
				Движение.Активность = Истина;
				ДВижение.Валюта = Рез.Валюта;
				Движение.ЕдиницаИзмерения = Рез.ЕдиницаИзмерения;
				Движение.Номенклатура = Рез.Номенклатура;
				Движение.Остаток = 0;
				Движение.Период = НачалоДня(Дата)-1;
				Движение.ТипЦен = Рез.ТипЦен;
				Движение.Цена = 0;
				Движение.ЦенаБН = 0;
				Движение.РекОпт = 0;
				Движение.РекОптБН = 0;
				Движение.РекРозница = 0;
				Движение.РекРозницаБН = 0;
				Движение.МІСТО = "";
				Движение.Поставщик = "";
				
			КонецЕсли;
		КонецЕслИ;
	КонецЦикла;
	
	//FOFA
	Струк = Новый Структура;
	Струк.Вставить("Документ",Ссылка);
	ДатыПроизв = РегистрыСведений.ДатыПроизводства.Выбрать(,,Струк);
	пока ДатыПроизв.Следующий() Цикл
		ДатаПр = ДатыПроизв.ПолучитьМенеджерЗаписи();
		ДатаПр.Удалить();
	КонецЦикла;
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ЧерныйСписокНоменклатуры.Контрагент,
	|	ЧерныйСписокНоменклатуры.Номенклатура
	|ИЗ
	|	РегистрСведений.ЧерныйСписокНоменклатуры КАК ЧерныйСписокНоменклатуры";
	Черный = Запрос.Выполнить().Выбрать();
	Для Каждого Строка Из Товары Цикл
		//Если ЗначениеЗаполнено(Строка.ДатаПроизводства) или ЗначениеЗаполнено(Строка.Производитель) Тогда
			ДатаПр = РегистрыСведений.ДатыПроизводства.СоздатьМенеджерЗаписи();
			ДатаПр.ДатаПроизводства = Строка.ДатаПроизводства;
			ДатаПр.Документ = Ссылка;
			ДатаПр.Номенклатура = Строка.Номенклатура;
			ДатаПр.Период = ДАта;
			ДатАПр.Поставщик = Контрагент;
			ДатаПр.Страна = Строка.Производитель;
			ДатаПр.Записать();
		//КонецЕслИ;
		если Строка.ЧерныйСписок тогда
		Струк = Новый Структура;
		Струк.Вставить("Контрагент",Контрагент);
		Струк.Вставить("Номенклатура",Строка.НоменклатураПоставщика);
			Черный.Сбросить();
			есть = Ложь;
			Пока Черный.НайтиСледующий(Струк) Цикл
				есть = Истина;
			КонецЦикла;
			если Не Есть Тогда
				ЧерныйСписок = РегистрыСведений.ЧерныйСписокНоменклатуры.СоздатьМенеджерЗаписи();
				ЧерныйСписок.Номенклатура = Строка.НоменклатураПоставщика;
				ЧерныйСписок.Контрагент = Контрагент;
				ЧерныйСписок.Записать();
			конецЕслИ;
			
		Иначе
		Струк = Новый Структура;
		Струк.Вставить("Контрагент",Контрагент);
			ЧерныйСписок = РегистрыСведений.ЧерныйСписокНоменклатуры.Выбрать(Струк);
			пока ЧерныйСписок.Следующий() Цикл
				если Строка.НоменклатураПоставщика = ЧерныйСписок.Номенклатура Тогда
				ЧерныйСписокЗапись = ЧерныйСписок.ПолучитьМенеджерЗаписи();
				ЧерныйСписокЗапись.Удалить();
				КонецЕслИ;
			КонецЦикла;
			
		КонецЕсли;
	КонецЦикла;
	
	
//Если Не Отказ тогда 03122025
//	Попытка
//		ТипЦен = ТипыЦен.Найти(Справочники.ТипыЦенНоменклатуры.НайтиПоНаименованию("ionity.tires",,,),"ТипЦен");
//		Если ТипЦен = Неопределено тогда
//			Возврат;
//		КонецЕсли;
//		
//		ЭтоЦеныНомеклатуры = Ложь;

//		МассивПараметров = Новый Массив;
//		МассивПараметров.Добавить(Дата);
//		МассивПараметров.Добавить(Справочники.ТипыЦенНоменклатуры.НайтиПоНаименованию("ionity.tires",,,));
//		МассивПараметров.Добавить(Ссылка); 
//		МассивПараметров.Добавить(ЭтоЦеныНомеклатуры);
//		ФоновыеЗадания.Выполнить("БП_ОбменMagentoВФоне.БП_ВыполнитьОтправкуНаСайтЦеныНоменклатуры", МассивПараметров,,"ОтправкаЦенНоменклатурыКонтрагентовНаСайт");
//		Сообщить("Вивантаження номенклатури на сайт почалось. Ви можете продовжувати користуватись програмою, невдовзі оновлені дані з'являться на сайті.");
//	Исключение
//		Сообщить("Не вдалося запустити вивантаження на сайт. Зверніться до адміністратора!");
//	КонецПопытки; 
//	
//КонецЕсли;03122025
КонецПроцедуры	// ОбработкаПроведения

// Процедура - обработчик события "ПередЗаписью".
//
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	мУдалятьДвижения = НЕ ЭтоНовый();
	
	Если ОбменДанными.Загрузка  Тогда
		Возврат;
	КонецЕсли;
	
	Информация = "";
	Для Каждого ТекущийТип Из ТипыЦен Цикл
		Если Информация <> "" Тогда
			Информация = Информация + ", ";
		КонецЕсли;
		Информация = Информация + СокрЛП(ТекущийТип.ТипЦен);
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	
	ОбщегоНазначения.УдалитьДвиженияРегистратора(ЭтотОбъект, Отказ);
	//FOFA
	Струк = Новый Структура;
	Струк.Вставить("Документ",Ссылка);
	ДатыПроизв = РегистрыСведений.ДатыПроизводства.Выбрать(,,Струк);
	пока ДатыПроизв.Следующий() Цикл
		ДатаПр = ДатыПроизв.ПолучитьМенеджерЗаписи();
		ДатаПр.Удалить();
	КонецЦикла;
	
КонецПроцедуры // ОбработкаУдаленияПроведения

Процедура БП_ВыполнитьОтправкуНаСайт()
	Номенклатура = Товары.ВыгрузитьКолонку("Номенклатура");
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ЦеныНоменклатурыКонтрагентовСрезПоследних.Номенклатура,
	                      |	ЦеныНоменклатурыКонтрагентовСрезПоследних.Цена
	                      |ИЗ
	                      |	РегистрСведений.ЦеныНоменклатурыКонтрагентов.СрезПоследних(&Дата, Номенклатура В (&МассивНоменклатури)) КАК ЦеныНоменклатурыКонтрагентовСрезПоследних
	                      |ГДЕ
	                      |	ЦеныНоменклатурыКонтрагентовСрезПоследних.Регистратор.Ссылка <> &Ссылка");
	
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("МассивНоменклатури", Номенклатура);
	Запрос.УстановитьПараметр("Ссылка", Ссылка); 
	
	ТЗСтараяЦена = Запрос.Выполнить().Выгрузить();
	
	Запрос = Новый Запрос("ВЫБРАТЬ 
	                      |	ДатыПроизводстваСрезПоследних.Номенклатура,
	                      |	ДатыПроизводстваСрезПоследних.Поставщик,
	                      |	ДатыПроизводстваСрезПоследних.ДатаПроизводства,
	                      |	ДатыПроизводстваСрезПоследних.Страна
	                      |ИЗ
	                      |	РегистрСведений.ДатыПроизводства.СрезПоследних(&Дата, Номенклатура В (&МассивНоменклатури)) КАК ДатыПроизводстваСрезПоследних");
	
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("МассивНоменклатури", Номенклатура);
 
	ТЗДатыПроизводства = Запрос.Выполнить().Выгрузить(); 
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ТоварыНаСкладахОстатки.Номенклатура,
	                      |	СУММА(ТоварыНаСкладахОстатки.КоличествоОстаток) КАК КоличествоОстаток
	                      |ИЗ
	                      |	РегистрНакопления.ТоварыНаСкладах.Остатки(&Дата, Номенклатура В (&МассивНоменклатури)) КАК ТоварыНаСкладахОстатки
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	ТоварыНаСкладахОстатки.Номенклатура");
	
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("МассивНоменклатури", Номенклатура);
 
	ТЗОстаток = Запрос.Выполнить().Выгрузить();


	
	Для каждого Стр из Товары цикл 
		
		
			
		СтруктураОтправки_category = Новый Структура;
		МассивРеквизитовКОтправке = Новый Массив;  
		МассивСортировок = Новый Массив;
		СтруктураОтправки_category.Вставить("sku", Стр.Номенклатура.Код);
		СтруктураОтправки_category.Вставить("erp_id", Стр.Номенклатура.Код);
		
		НайденнаяСтрока = ТЗСтараяЦена.Найти(Стр.Номенклатура, "Номенклатура");
		Если НайденнаяСтрока = Неопределено Тогда
			price_old = 0;
		Иначе
			price_old = НайденнаяСтрока.Цена;
		КонецЕсли;
		
		Если price_old = Стр.Цена тогда
			Продолжить;
		КонецЕсли;
		
		НайденнаяСтрока = ТЗОстаток.Найти(Стр.Номенклатура, "Номенклатура");
		Если НайденнаяСтрока = Неопределено Тогда
			qty = 0;
		Иначе
			qty = НайденнаяСтрока.КоличествоОстаток;
		КонецЕсли;
		
		Страна = "";
		ДатаПроизводства = "";
		Отбор = Новый Структура("Номенклатура, Поставщик",Стр.Номенклатура, Стр.Поставщик);
		Строки = ТЗДатыПроизводства.НайтиСтроки(Отбор);
		Если Строки.Количество() > 0 Тогда
			ДатаПроизводства = Строки[0].ДатаПроизводства; 
			Страна = Строки[0].Страна;
		КонецЕсли;
		
		
		//СтруктураОтправки_category.Вставить("name", Источник.Наименование);	
		СтруктураОтправки_category.Вставить("price_old", price_old);  
		СтруктураОтправки_category.Вставить("price_new", Стр.Цена); 
		СтруктураОтправки_category.Вставить("qty", qty);
		СтруктураОтправки_category.Вставить("currency", "UAH"); 
		СтруктураОтправки_category.Вставить("sort_options", МассивСортировок);
		
		
		МассивРеквизитовКОтправке.Добавить(Новый Структура("code, value","producer_country",Страна));
		МассивРеквизитовКОтправке.Добавить(Новый Структура("code, value","manufacturer_year",ДатаПроизводства));
		СтруктураОтправки_category.Вставить("attributes_values", МассивРеквизитовКОтправке); 
		
		СтруктураОтправки = Новый Структура;
		СтруктураОтправки.Вставить("product", СтруктураОтправки_category); 
		
		БП_ОбменMagento.УстановкаЦенНоменклатуриОтправить(СтруктураОтправки);
	КонецЦикла;
	
КонецПроцедуры

мИспользоватьХарактеристики     = глЗначениеПеременной("ИспользоватьХарактеристикиНоменклатуры");
